In [4]:
%reload_ext sql

In [5]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/music

SELECT 1+1;

1 rows affected.

[(2,)]

## A 1: Who is the senior most employee based on job title?

In [7]:
%%sql
SELECT
  *
FROM employee
ORDER BY levels DESC limit 1

 * mysql+pymysql://root:***@localhost:3306/music
1 rows affected.

[(1, 'Adams', 'Andrew', 'General Manager', 9, 'L6', '18-02-1962', '14-08-2016', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')]

## A 2:Which countries have the most Invoices?

In [8]:
%%sql
SELECT
  billing_country,
  COUNT(*) AS most_invoices
FROM invoice
GROUP BY 1 limit 5

 * mysql+pymysql://root:***@localhost:3306/music
5 rows affected.

[('USA', 131), ('Canada', 76), ('France', 50), ('Poland', 10), ('India', 21)]

## A 3: What are top 3 values of total invoice?

In [9]:
%%sql
SELECT
  ROUND(total, 2) AS Top_3_total
FROM invoice
ORDER BY 1 DESC limit 3

 * mysql+pymysql://root:***@localhost:3306/music
3 rows affected.

[(23.76,), (19.8,), (19.8,)]

## A 4: Which city has the best customers? We would like to throw a promotional Music Festival in the city we made the most money. 
- Write a query that returns one city that has the highest sum of invoice totals. 
- Return both the city name & sum of all invoice totals

In [10]:
%%sql
SELECT
  billing_city,
  ROUND(SUM(total), 1) AS Total,
  COUNT(customer_id) AS Total_customer
FROM invoice
GROUP BY 1
ORDER BY 2 DESC limit 1

 * mysql+pymysql://root:***@localhost:3306/music
1 rows affected.

[('Prague', 273.2, 30)]

## A 5: Who is the best customer? The customer who has spent the most money will be declared the best customer. 
- Write a query that returns the person who has spent the most money

In [75]:
%%sql
SELECT c.customer_id, first_name, last_name, SUM(total) AS total_spending
FROM customer c
JOIN invoice i ON c.customer_id = i.customer_id
GROUP BY 1,2,3
ORDER BY 2 DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/music
1 rows affected.

[(42, 'Wyatt', 'Girard', 99.99)]

## B 1 : Q1: Write query to return the email, first name, last name, & Genre of all Rock Music listeners. 
- Return your list ordered alphabetically by email starting with A.

In [6]:
%%sql
WITH sub
     AS (SELECT track_id
         FROM   genre
                LEFT JOIN track
                       ON track.genre_id = genre.genre_id
         WHERE  genre.NAME = "rock"),
     sub_2
     AS (SELECT *
         FROM   sub
                INNER JOIN invoice_line using (track_id)),
     sub_3
     AS (SELECT *
         FROM   sub_2
                INNER JOIN invoice using(invoice_id))
SELECT DISTINCT( email ),
               first_name,
               last_name
FROM   sub_3
       INNER JOIN customer using(customer_id)
ORDER  BY email limit 5

 * mysql+pymysql://root:***@localhost:3306/music
5 rows affected.

[('aaronmitchell@yahoo.ca', 'Aaron', 'Mitchell'),
 ('alero@uol.com.br', 'Alexandre', 'Rocha'),
 ('astrid.gruber@apple.at', 'Astrid', 'Gruber'),
 ('bjorn.hansen@yahoo.no', 'BjÃ¸rn', 'Hansen'),
 ('camille.bernard@yahoo.fr', 'Camille', 'Bernard')]

## Another Answar

In [7]:
%%sql
SELECT DISTINCT
  email,
  first_name,
  last_name
FROM customer
JOIN invoice
  ON customer.customer_id = invoice.customer_id
JOIN invoice_line
  ON invoice.invoice_id = invoice_line.invoice_id
WHERE track_id IN (SELECT
  track_id
FROM track
JOIN genre
  ON track.genre_id = genre.genre_id
WHERE genre.name LIKE 'Rock')
ORDER BY email limit 5;

 * mysql+pymysql://root:***@localhost:3306/music
5 rows affected.

[('aaronmitchell@yahoo.ca', 'Aaron', 'Mitchell'),
 ('alero@uol.com.br', 'Alexandre', 'Rocha'),
 ('astrid.gruber@apple.at', 'Astrid', 'Gruber'),
 ('bjorn.hansen@yahoo.no', 'BjÃ¸rn', 'Hansen'),
 ('camille.bernard@yahoo.fr', 'Camille', 'Bernard')]

## B 2: Let's invite the artists who have written the most rock music in our dataset. 
- Write a query that returns the Artist name and total track count of the top 10 rock bands.

In [32]:
%%sql
SELECT artist.artist_id,
       artist.NAME,
       Count(track_id) as number_of_songs
FROM   artist
       JOIN album2 using(artist_id)
       JOIN track
         ON track.album_id = album2.album_id
WHERE  track_id IN (SELECT track_id
                    FROM   track
                           JOIN genre
                             ON track.genre_id = genre.genre_id
                    WHERE  genre.NAME LIKE 'Rock')
GROUP  BY 1,
          2
ORDER  BY 3 DESC 
limit 10

 * mysql+pymysql://root:***@localhost:3306/music
8 rows affected.

[(1, 'AC/DC', 18),
 (3, 'Aerosmith', 15),
 (8, 'Audioslave', 14),
 (22, 'Led Zeppelin', 14),
 (4, 'Alanis Morissette', 13),
 (5, 'Alice In Chains', 12),
 (23, 'Frank Zappa & Captain Beefheart', 9),
 (2, 'Accept', 4)]

## Another Answar

In [15]:
%%sql
SELECT
  artist.artist_id,
  artist.name,
  COUNT(artist.artist_id) AS number_of_songs
FROM track
JOIN album2
  ON album2.album_id = track.album_id
JOIN artist
  ON artist.artist_id = album2.artist_id
JOIN genre
  ON genre.genre_id = track.genre_id
WHERE genre.name LIKE 'Rock'
GROUP BY artist.artist_id,
         artist.name
ORDER BY number_of_songs DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/music
8 rows affected.

[(1, 'AC/DC', 18),
 (3, 'Aerosmith', 15),
 (8, 'Audioslave', 14),
 (22, 'Led Zeppelin', 14),
 (4, 'Alanis Morissette', 13),
 (5, 'Alice In Chains', 12),
 (23, 'Frank Zappa & Captain Beefheart', 9),
 (2, 'Accept', 4)]

## B 3: Return all the track names that have a song length longer than the average song length. 
- Return the Name and Milliseconds for each track. Order by the song length with the longest songs listed first. */

In [8]:
%%sql
SELECT
  name,
  round((milliseconds / 60000),0) AS song_timing_min
FROM track
WHERE (milliseconds / 1000) > (SELECT
  AVG(milliseconds / 1000)
FROM track)
ORDER BY 2 DESC limit 5

 * mysql+pymysql://root:***@localhost:3306/music
5 rows affected.

[('How Many More Times', Decimal('12')),
 ('Sleeping Village', Decimal('11')),
 ('Advance Romance', Decimal('11')),
 ('Stratus', Decimal('10')),
 ("Talkin' 'Bout Women Obviously", Decimal('10'))]

## C 1: Find how much amount spent by each customer on artists? Write a query to return customer name, artist name and total spent */

In [9]:
%%sql
SELECT customer_id,
       first_name,
       last_name,
       round(Sum(invoice_line.unit_price * quantity),2) as Total_spent,
       artist.NAME
FROM   customer
       JOIN invoice using(customer_id)
       JOIN invoice_line
         ON invoice.invoice_id = invoice_line.invoice_id
       JOIN track
         ON track.track_id = invoice_line.track_id
       JOIN album2
         ON album2.album_id = track.album_id
       JOIN artist
         ON artist.artist_id = album2.artist_id
GROUP  BY 1,2,3,5
ORDER  BY 4 DESC  limit 5

 * mysql+pymysql://root:***@localhost:3306/music
5 rows affected.

[(54, 'Steve', 'Murray', 17.82, 'AC/DC'),
 (15, 'Jennifer', 'Peterson', 14.85, 'Aerosmith'),
 (55, 'Mark', 'Taylor', 14.85, 'Aerosmith'),
 (13, 'Fernanda', 'Ramos', 13.86, 'AntÃ´nio Carlos Jobim'),
 (2, 'Leonie', 'KÃ¶hler', 13.86, 'Audioslave')]

## C 2: We want to find out the most popular music Genre for each country. We determine the most popular genre as the genre 
- with the highest amount of purchases. Write a query that returns each country along with the top Genre. 
- For countries  where the maximum number of purchases is shared return all Genres.

In [21]:
%%sql
WITH sub
     AS (SELECT country,
                Count(track.genre_id)                    AS No_of_time_purchase,
                genre.NAME,
                Row_number()
                  OVER(
                    partition BY country
                    ORDER BY Count(track.genre_id) DESC) AS rn
         FROM   customer
                JOIN invoice using (customer_id)
                JOIN invoice_line using(invoice_id)
                JOIN track using(track_id)
                JOIN genre using(genre_id)
         GROUP  BY 1,
                   3)
SELECT *
FROM   sub
WHERE  rn = 1

 * mysql+pymysql://root:***@localhost:3306/music
24 rows affected.

[('Argentina', 1, 'Rock', 1),
 ('Australia', 18, 'Rock', 1),
 ('Austria', 6, 'Rock', 1),
 ('Belgium', 5, 'Rock', 1),
 ('Brazil', 26, 'Rock', 1),
 ('Canada', 57, 'Rock', 1),
 ('Chile', 7, 'Rock', 1),
 ('Czech Republic', 14, 'Rock', 1),
 ('Denmark', 6, 'Rock', 1),
 ('Finland', 6, 'Rock', 1),
 ('France', 26, 'Rock', 1),
 ('Germany', 28, 'Rock', 1),
 ('Hungary', 4, 'Rock', 1),
 ('India', 13, 'Rock', 1),
 ('Ireland', 2, 'Rock', 1),
 ('Italy', 3, 'Rock', 1),
 ('Netherlands', 6, 'Rock', 1),
 ('Norway', 2, 'Metal', 1),
 ('Poland', 14, 'Rock', 1),
 ('Portugal', 23, 'Rock', 1),
 ('Spain', 4, 'Metal', 1),
 ('Sweden', 5, 'Rock', 1),
 ('United Kingdom', 47, 'Rock', 1),
 ('USA', 70, 'Rock', 1)]

## C 3: Write a query that determines the customer that has spent the most on music for each country. 
Write a query that returns the country along with the top customer and how much they spent. 
For countries where the top amount spent is shared, provide all customers who spent this amount. */

In [23]:
%%sql
WITH sub
     AS (SELECT customer_id,
                country,
                Round(Sum(total), 1)          AS total_spend,
                Row_number()
                  OVER(
                    partition BY country
                    ORDER BY Sum(total) DESC) AS rn
         FROM   customer
                JOIN invoice using(customer_id)
         GROUP  BY 1,
                   2)
SELECT customer_id,
       country,
       total_spend
FROM   sub
WHERE  rn = 1

 * mysql+pymysql://root:***@localhost:3306/music
24 rows affected.

[(56, 'Argentina', 39.6),
 (55, 'Australia', 81.2),
 (7, 'Austria', 69.3),
 (8, 'Belgium', 60.4),
 (1, 'Brazil', 108.9),
 (3, 'Canada', 100.0),
 (57, 'Chile', 97.0),
 (5, 'Czech Republic', 144.5),
 (9, 'Denmark', 37.6),
 (44, 'Finland', 79.2),
 (42, 'France', 100.0),
 (37, 'Germany', 94.1),
 (45, 'Hungary', 78.2),
 (58, 'India', 111.9),
 (46, 'Ireland', 114.8),
 (47, 'Italy', 50.5),
 (48, 'Netherlands', 65.3),
 (4, 'Norway', 72.3),
 (49, 'Poland', 76.2),
 (34, 'Portugal', 103.0),
 (50, 'Spain', 98.0),
 (51, 'Sweden', 75.2),
 (53, 'United Kingdom', 98.0),
 (17, 'USA', 98.0)]